<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Aggregating-and-Combining-pandas-DataFrames" data-toc-modified-id="Aggregating-and-Combining-pandas-DataFrames-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Aggregating and Combining <code>pandas</code> DataFrames</a></span><ul class="toc-item"><li><span><a href="#Learning-Goals" data-toc-modified-id="Learning-Goals-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Learning Goals</a></span><ul class="toc-item"><li><span><a href="#Austin-Animal-Center-Data" data-toc-modified-id="Austin-Animal-Center-Data-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>Austin Animal Center Data</a></span></li></ul></li><li><span><a href="#Aggregating-over-DataFrames:-.groupby()" data-toc-modified-id="Aggregating-over-DataFrames:-.groupby()-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Aggregating over DataFrames: <code>.groupby()</code></a></span><ul class="toc-item"><li><span><a href="#.groups-and-.get_group()" data-toc-modified-id=".groups-and-.get_group()-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span><code>.groups</code> and <code>.get_group()</code></a></span><ul class="toc-item"><li><span><a href="#Multi-Indexing" data-toc-modified-id="Multi-Indexing-1.2.1.1"><span class="toc-item-num">1.2.1.1&nbsp;&nbsp;</span>Multi-Indexing</a></span></li></ul></li><li><span><a href="#Aggregating" data-toc-modified-id="Aggregating-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>Aggregating</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.2.3"><span class="toc-item-num">1.2.3&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Pivoting-a-DataFrame" data-toc-modified-id="Pivoting-a-DataFrame-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Pivoting a DataFrame</a></span><ul class="toc-item"><li><span><a href="#.pivot_table()" data-toc-modified-id=".pivot_table()-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span><code>.pivot_table()</code></a></span><ul class="toc-item"><li><span><a href="#Example" data-toc-modified-id="Example-1.3.1.1"><span class="toc-item-num">1.3.1.1&nbsp;&nbsp;</span>Example</a></span></li><li><span><a href="#Back-to-Austin-animals" data-toc-modified-id="Back-to-Austin-animals-1.3.1.2"><span class="toc-item-num">1.3.1.2&nbsp;&nbsp;</span>Back to Austin animals</a></span></li></ul></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()" data-toc-modified-id="Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Methods for Combining DataFrames: <code>.join()</code>, <code>.merge()</code>, <code>pd.concat()</code></a></span><ul class="toc-item"><li><span><a href="#.join()" data-toc-modified-id=".join()-1.4.1"><span class="toc-item-num">1.4.1&nbsp;&nbsp;</span><code>.join()</code></a></span></li><li><span><a href="#.merge()" data-toc-modified-id=".merge()-1.4.2"><span class="toc-item-num">1.4.2&nbsp;&nbsp;</span><code>.merge()</code></a></span></li><li><span><a href="#The-how-Parameter" data-toc-modified-id="The-how-Parameter-1.4.3"><span class="toc-item-num">1.4.3&nbsp;&nbsp;</span>The <code>how</code> Parameter</a></span></li><li><span><a href="#pd.concat()" data-toc-modified-id="pd.concat()-1.4.4"><span class="toc-item-num">1.4.4&nbsp;&nbsp;</span><code>pd.concat()</code></a></span></li></ul></li><li><span><a href="#King-County-Assessments" data-toc-modified-id="King-County-Assessments-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>King County Assessments</a></span><ul class="toc-item"><li><span><a href="#First,-get-the-data!" data-toc-modified-id="First,-get-the-data!-1.5.1"><span class="toc-item-num">1.5.1&nbsp;&nbsp;</span>First, get the data!</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.5.2"><span class="toc-item-num">1.5.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Time-Permitting:-Data-Cleaning-with-Pandas" data-toc-modified-id="Time-Permitting:-Data-Cleaning-with-Pandas-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Time Permitting: Data Cleaning with Pandas</a></span><ul class="toc-item"><li><span><a href="#1.-Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns." data-toc-modified-id="1.-Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns.-1.6.1"><span class="toc-item-num">1.6.1&nbsp;&nbsp;</span>1. Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.</a></span></li><li><span><a href="#2.-Investigate-and-handle-non-numeric-ZipCode-values" data-toc-modified-id="2.-Investigate-and-handle-non-numeric-ZipCode-values-1.6.2"><span class="toc-item-num">1.6.2&nbsp;&nbsp;</span>2. Investigate and handle non-numeric ZipCode values</a></span></li><li><span><a href="#3.-Add-a-column-for-PricePerSqFt" data-toc-modified-id="3.-Add-a-column-for-PricePerSqFt-1.6.3"><span class="toc-item-num">1.6.3&nbsp;&nbsp;</span>3. Add a column for PricePerSqFt</a></span></li><li><span><a href="#4.-Subset-the-data-to-2021-sales-only." data-toc-modified-id="4.-Subset-the-data-to-2021-sales-only.-1.6.4"><span class="toc-item-num">1.6.4&nbsp;&nbsp;</span>4. Subset the data to 2021 sales only.</a></span></li><li><span><a href="#5.-What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?" data-toc-modified-id="5.-What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?-1.6.5"><span class="toc-item-num">1.6.5&nbsp;&nbsp;</span>5. What is the mean price per square foot for a house sold in Seattle in 2021?</a></span></li></ul></li><li><span><a href="#Level-Up:-pandas.set_option()" data-toc-modified-id="Level-Up:-pandas.set_option()-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Level Up: <code>pandas.set_option()</code></a></span><ul class="toc-item"><li><span><a href="#Block-Scientific-Notation" data-toc-modified-id="Block-Scientific-Notation-1.7.1"><span class="toc-item-num">1.7.1&nbsp;&nbsp;</span>Block Scientific Notation</a></span></li><li><span><a href="#See-More-Rows" data-toc-modified-id="See-More-Rows-1.7.2"><span class="toc-item-num">1.7.2&nbsp;&nbsp;</span>See More Rows</a></span></li></ul></li></ul></li></ul></div>

# Aggregating and Combining `pandas` DataFrames

In [1]:
import pandas as pd
import numpy as np
import requests as rq
#requests gets data from the web
from sklearn.preprocessing import OneHotEncoder
from zipfile import ZipFile

## Learning Goals

- Use GroupBy objects to organize and aggregate data
- Create pivot tables from DataFrames
- Combine DataFrames by merging and appending

We'll work with the Austin Animal Center dataset and with data from King County's Department of Assessments (Seattle housing data).

### Austin Animal Center Data

In [2]:
data = rq.get('https://data.austintexas.gov/resource/9t4d-g238.json').text

In [3]:
animals = pd.read_json(data)

In [4]:
animals.head()

,animal_id,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,name
0,A833386,2021-05-03 09:12:00,2021-05-03T09:12:00.000,2020-04-29T00:00:00.000,Euthanasia,Rabies Risk,Other,Unknown,1 year,Bat,Black,NaN
1,A833565,2021-05-03 07:36:00,2021-05-03T07:36:00.000,2020-05-02T00:00:00.000,Died,In Kennel,Other,Unknown,1 year,Bat,Brown,NaN
2,A829674,2021-05-02 17:37:00,2021-05-02T17:37:00.000,2019-02-20T00:00:00.000,Adoption,NaN,Dog,Spayed Female,2 years,Border Collie Mix,Black/White,Ebony
3,A832899,2021-05-02 16:47:00,2021-05-02T16:47:00.000,2021-02-06T00:00:00.000,Transfer,Partner,Dog,Neutered Male,2 months,Siberian Husky/German Shepherd,Tan/White,*Superman - Event
4,A832788,2021-05-02 15:56:00,2021-05-02T15:56:00.000,2019-04-19T00:00:00.000,Adoption,NaN,Dog,Neutered Male,2 years,Dutch Shepherd Mix,Brown Brindle/White,*Bruno

## Aggregating over DataFrames: `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. (And if you haven't, you'll see it very soon!) Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [5]:
animals.groupby('animal_type')

In [6]:
animals.columns

Index(['animal_id', 'datetime', 'monthyear', 'date_of_birth', 'outcome_type',
       'outcome_subtype', 'animal_type', 'sex_upon_outcome',
       'age_upon_outcome', 'breed', 'color', 'name'],
      dtype='object')

We can group by multiple columns, and also return a DataFrameGroupBy object

Notice the object type [DataFrameGroupBy](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html) object.

### `.groups` and `.get_group()`

In [7]:
animals.groupby(['animal_type', 'outcome_type'])

In [8]:
# This retuns each group indexed by the group name: I.E. 'Bird', along with the row indices of each value
animals.groupby('animal_type').groups

{'Bird': [225, 445, 446, 447, 461, 529, 958], 'Cat': [9, 10, 11, 12, 13, 19, 20, 26, 44, 46, 48, 51, 52, 64, 65, 66, 82, 84, 86, 89, 90, 91, 92, 99, 103, 104, 105, 106, 107, 108, 111, 112, 113, 114, 115, 116, 122, 123, 130, 131, 132, 133, 136, 139, 140, 149, 150, 151, 152, 153, 154, 156, 161, 164, 165, 170, 173, 174, 175, 176, 177, 182, 186, 187, 188, 189, 192, 193, 202, 220, 221, 222, 223, 227, 229, 233, 234, 248, 256, 257, 259, 260, 263, 272, 278, 279, 282, 283, 284, 285, 286, 287, 289, 291, 296, 297, 298, 300, 305, 316, ...], 'Dog': [2, 3, 4, 5, 6, 7, 8, 15, 16, 17, 21, 22, 23, 24, 25, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 45, 47, 50, 53, 54, 55, 56, 57, 58, 59, 61, 63, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 83, 85, 87, 88, 93, 95, 96, 97, 98, 100, 101, 102, 109, 110, 124, 125, 126, 127, 128, 129, 134, 135, 137, 138, 141, 142, 143, 144, 145, 146, 147, 148, 155, 157, 158, 159, 160, 162, 163, 166, 167, ...], 'Other': [0, 1, 14, 18, 49, 60, 62, 94, 117, 118, 119, 120, 121, 171, 195, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 216, 253, 276, 281, 299, 303, 304, 306, 309, 315, 389, 390, 391, 392, 431, 435, 448, 456, 475, 478, 486, 492, 556, 558, 566, 567, 568, 576, 590, 594, 597, 598, 599, 609, 617, 619, 628, 629, 630, 643, 664, 677, 689, 697, 698, 699, 707, 710, 731, 765, 769, 770, 771, 772, 776, 788, 802, 808, 825, 831, 832, 855, 865, 866, 867, 881, 882, 921, 922, 923, 940, 941, 942, ...]}

Once we know we are working with a type of object, it opens up a suite of attributes and methods. One attribute we can look at is groups.

In [9]:
# Once we know the group indices, we can return the groups using those indices.
animals.groupby('animal_type').get_group('Dog')

,animal_id,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,name
2,A829674,2021-05-02 17:37:00,2021-05-02T17:37:00.000,2019-02-20T00:00:00.000,Adoption,NaN,Dog,Spayed Female,2 years,Border Collie Mix,Black/White,Ebony
3,A832899,2021-05-02 16:47:00,2021-05-02T16:47:00.000,2021-02-06T00:00:00.000,Transfer,Partner,Dog,Neutered Male,2 months,Siberian Husky/German Shepherd,Tan/White,*Superman - Event
4,A832788,2021-05-02 15:56:00,2021-05-02T15:56:00.000,2019-04-19T00:00:00.000,Adoption,NaN,Dog,Neutered Male,2 years,Dutch Shepherd Mix,Brown Brindle/White,*Bruno
5,A832671,2021-05-02 15:35:00,2021-05-02T15:35:00.000,2013-04-18T00:00:00.000,Transfer,Partner,Dog,Spayed Female,8 years,Pug,Black,Pepper
6,A832672,2021-05-02 15:35:00,2021-05-02T15:35:00.000,2016-04-18T00:00:00.000,Transfer,Partner,Dog,Spayed Female,5 years,Pug/Chihuahua Shorthair,Brown Brindle,Lucy
...,...,...,...,...,...,...,...,...,...,...,...,...
994,A545642,2021-03-23 09:39:00,2021-03-23T09:39:00.000,2009-01-05T00:00:00.000,Adoption,Foster,Dog,Spayed Female,12 years,Miniature Pinscher,Black/Brown,Cow
995,A735407,2021-03-23 07:35:00,2021-03-23T07:35:00.000,2010-11-23T00:00:00.000,Adoption,Foster,Dog,Neutered Male,10 years,Pit Bull,Blue,Blue
996,A830162,2021-03-23 07:25:00,2021-03-23T07:25:00.000,2021-01-20T00:00:00.000,Adoption,Foster,Dog,Neutered Male,2 months,French Bulldog/Miniature Poodle,Black/White,*Stanley
997,A830848,2021-03-22 17:44:00,2021-03-22T17:44:00.000,2020-08-17T00:00:00.000,Adoption,NaN,Dog,Neutered Male,7 months,Pit Bull Mix,Brown/White,*Chili
999,A830175,2021-03-22 17:15:00,2021-03-22T17:15:00.000,2018-03-03T00:00:00.000,Adoption,NaN,Dog,Spayed Female,3 years,German Shepherd Mix,Black/Brown,*Ella

#### Multi-Indexing

In [10]:
# Same goes for multi index groupbys
animal_outcome = animals.groupby(['animal_type', 'outcome_type'])
animal_outcome.groups

{('Other', 'Euthanasia'): [0, 14, 18, 49, 117, 118, 119, 120, 121, 171, 195, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 216, 253, 276, 303, 304, 309, 389, 390, 391, 448, 456, 478, 486, 556, 558, 566, 576, 590, 597, 598, 599, 609, 628, 629, 630, 643, 664, 677, 689, 697, 698, 699, 707, 731, 765, 769, 770, 771, 772, 776, 788, 808, 825, 831, 832, 855, 865, 866, 867, 881, 882, 921, 922, 923, 940, 941, 942, 943, 965, 966, 969, 993, 998], ('Other', 'Died'): [1], ('Dog', 'Adoption'): [2, 4, 7, 21, 22, 23, 25, 28, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 45, 47, 50, 53, 54, 57, 58, 59, 61, 63, 75, 85, 87, 88, 93, 95, 98, 100, 102, 109, 110, 124, 125, 126, 127, 128, 129, 134, 135, 137, 141, 142, 143, 144, 147, 148, 159, 160, 163, 172, 178, 179, 181, 184, 185, 190, 196, 198, 201, 217, 218, 219, 224, 226, 228, 230, 235, 240, 241, 245, 246, 247, 249, 254, 255, 261, 262, 264, 271, 275, 277, 288, 290, 292, 293, 294, 301, 302, ...], ('Dog', 'Transfer'): [3, 5, 6, 29, 68, 69, 70, 71, 72, 73, 74, 77, 78, 79, 80, 81, 83, 158, 166, 167, 168, 169, 194, 199, 200, 236, 237, 238, 239, 251, 258, 295, 335, 336, 337, 340, 362, 363, 370, 380, 381, 403, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 423, 424, 425, 426, 428, 429, 430, 438, 476, 481, 489, 491, 509, 514, 517, 524, 541, 542, 544, 551, 574, 584, 585, 586, 595, 611, 631, 642, 652, 656, 657, 658, 690, 691, 692, 694, 696, 732, 733, 741, 763, 764, 782, 785, 794, 805, ...], ('Dog', 'Return to Owner'): [8, 15, 16, 17, 24, 27, 55, 56, 67, 76, 96, 97, 101, 138, 145, 146, 155, 162, 180, 183, 191, 197, 231, 232, 242, 243, 265, 268, 269, 270, 273, 307, 308, 311, 338, 339, 341, 348, 352, 353, 356, 359, 364, 365, 366, 402, 421, 436, 442, 470, 471, 500, 501, 502, 516, 522, 526, 527, 528, 545, 552, 557, 575, 581, 601, 625, 638, 672, 676, 679, 680, 735, 739, 750, 751, 752, 753, 756, 778, 789, 813, 815, 816, 818, 824, 833, 835, 856, 860, 861, 874, 875, 878, 884, 893, 905, 906, 907, 909, 916, ...], ('Cat', 'Transfer'): [9, 10, 11, 12, 13, 19, 20, 44, 46, 65, 66, 82, 84, 89, 90, 91, 92, 103, 104, 105, 106, 107, 108, 111, 112, 113, 114, 116, 130, 131, 132, 133, 150, 151, 152, 153, 161, 164, 174, 175, 176, 177, 188, 192, 193, 220, 221, 222, 223, 227, 234, 256, 257, 259, 260, 278, 282, 283, 284, 285, 286, 287, 291, 296, 297, 298, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 350, 351, 367, 394, 395, 397, 398, 444, 449, 455, 460, 465, 466, 467, 497, 512, 513, 518, 519, 530, 531, 532, 533, ...], ('Cat', 'Return to Owner'): [26, 48, 229, 248, 300, 305, 383, 384, 385, 386, 387, 483, 583, 610, 616, 730, 736, 820, 870, 964], ('Cat', 'Adoption'): [51, 52, 64, 86, 99, 122, 123, 136, 140, 149, 156, 165, 173, 182, 186, 187, 202, 263, 272, 289, 316, 317, 318, 319, 347, 358, 378, 379, 388, 404, 405, 406, 407, 433, 468, 490, 494, 496, 504, 507, 508, 515, 523, 539, 540, 550, 555, 560, 561, 563, 573, 579, 623, 624, 632, 636, 644, 653, 659, 663, 668, 669, 670, 674, 675, 687, 701, 702, 712, 716, 717, 718, 722, 755, 757, 761, 762, 777, 801, 806, 807, 810, 812, 830, 840, 894, 903, 917, 920, 926, 933, 947, 957, 970, 989, 990], ('Other', 'Adoption'): [60, 62, 94, 299, 306, 315, 431, 435, 492, 567, 568, 617, 619, 710, 802], ('Cat', 'Rto-Adopt'): [115, 511], ('Cat', 'Euthanasia'): [139, 170, 189, 279, 320, 393, 459, 498, 569, 605, 637, 684, 817, 901, 911], ('Cat', nan): [154, 233], ('Dog', 'Rto-Adopt'): [157, 244, 252, 266, 280, 344, 376, 432, 618, 728, 798], ('Other', 'Disposal'): [203, 392, 475], ('Dog', 'Euthanasia'): [215, 342, 372, 457, 577, 787, 800, 938], ('Bird', 'Adoption'): [225], ('Dog', nan): [250, 314, 322], ('Dog', 'Died'): [267, 274, 458, 786], ('Other', 'Transfer'): [281], ('Bird', 'Transfer'): [445, 446, 447], ('Bird', 'Euthanasia'): [461], ('Cat', 'Died'): [499], ('Bird', 'Died'): [529], ('Cat', 'Disposal'): [578, 827], ('Other', 'Return to Owner'): [594], ('Dog', 'Disposal'): [828], ('Bird', 'Return to Owner'): [958]}

In [11]:
# animal_outcome.groups is a dictionary, so we can access the group names using keys()
animal_outcome.groups.keys()

dict_keys([('Other', 'Euthanasia'), ('Other', 'Died'), ('Dog', 'Adoption'), ('Dog', 'Transfer'), ('Dog', 'Return to Owner'), ('Cat', 'Transfer'), ('Cat', 'Return to Owner'), ('Cat', 'Adoption'), ('Other', 'Adoption'), ('Cat', 'Rto-Adopt'), ('Cat', 'Euthanasia'), ('Cat', nan), ('Dog', 'Rto-Adopt'), ('Other', 'Disposal'), ('Dog', 'Euthanasia'), ('Bird', 'Adoption'), ('Dog', nan), ('Dog', 'Died'), ('Other', 'Transfer'), ('Bird', 'Transfer'), ('Bird', 'Euthanasia'), ('Cat', 'Died'), ('Bird', 'Died'), ('Cat', 'Disposal'), ('Other', 'Return to Owner'), ('Dog', 'Disposal'), ('Bird', 'Return to Owner')])

In [13]:
# We can then get a specific group, such as Cats that were adopted
animal_outcome.get_group(('Cat', 'Adoption'))
#don't forget the key is now a tuple

,animal_id,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,name
51,A833244,2021-04-30 18:09:00,2021-04-30T18:09:00.000,2019-04-26T00:00:00.000,Adoption,NaN,Cat,Spayed Female,2 years,Domestic Shorthair,Orange Tabby,NaN
52,A833245,2021-04-30 18:08:00,2021-04-30T18:08:00.000,2021-03-11T00:00:00.000,Adoption,NaN,Cat,Spayed Female,1 month,Domestic Shorthair,Cream Tabby,NaN
64,A833246,2021-04-30 16:29:00,2021-04-30T16:29:00.000,2021-03-11T00:00:00.000,Adoption,NaN,Cat,Neutered Male,1 month,Domestic Shorthair,Cream Tabby,NaN
86,A832117,2021-04-30 12:00:00,2021-04-30T12:00:00.000,2019-04-07T00:00:00.000,Adoption,NaN,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby,Buster
99,A833077,2021-04-29 16:25:00,2021-04-29T16:25:00.000,2020-04-23T00:00:00.000,Adoption,NaN,Cat,Spayed Female,1 year,Domestic Shorthair,White/Black,*Maeve
...,...,...,...,...,...,...,...,...,...,...,...,...
947,A830787,2021-03-25 10:01:00,2021-03-25T10:01:00.000,2019-03-16T00:00:00.000,Adoption,NaN,Cat,Intact Male,2 years,Siamese,Lynx Point,Zimba
957,A831044,2021-03-24 16:41:00,2021-03-24T16:41:00.000,2020-04-21T00:00:00.000,Adoption,NaN,Cat,Spayed Female,11 months,Domestic Shorthair,Brown Tabby,Kiri
970,A830792,2021-03-23 17:46:00,2021-03-23T17:46:00.000,2020-03-16T00:00:00.000,Adoption,NaN,Cat,Neutered Male,1 year,Domestic Shorthair Mix,Black/White,Hunnii
989,A830435,2021-03-23 11:57:00,2021-03-23T11:57:00.000,2018-04-09T00:00:00.000,Adoption,Foster,Cat,Neutered Male,2 years,Domestic Shorthair,Blue Tabby,Benji
990,A813886,2021-03-23 11:53:00,2021-03-23T11:53:00.000,2019-07-20T00:00:00.000,Adoption,NaN,Cat,Spayed Female,1 year,Domestic Shorthair,Black/White,Chula

### Aggregating

Once again, as we will see in SQL, groupby objects are intended to be used with aggregation. In SQL, we will see that our queries that include GROUP BY require aggregation performed on columns.

We can use `.sum()`, `.mean()`, `.count()`, `.max()`, `.min()`, etc. Find a list of common aggregations [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html).

In [14]:
animals.groupby('animal_type').count()

,animal_id,datetime,monthyear,date_of_birth,outcome_type,outcome_subtype,sex_upon_outcome,age_upon_outcome,breed,color,name
animal_type,,,,,,,,,,,
Bird,7,7,7,7,7,5,7,7,7,7,3
Cat,312,312,312,312,310,227,312,312,312,312,175
Dog,575,575,575,575,572,220,575,575,575,575,465
Other,106,106,106,106,106,86,106,106,106,106,16

### Exercise

Use `.groupby()` to find the most recently born of each (main) animal type.

In [26]:
animals.groupby('animal_type')['date_of_birth'].max()

animal_type
Bird     2021-03-15T00:00:00.000
Cat      2021-04-30T00:00:00.000
Dog      2021-04-16T00:00:00.000
Other    2021-03-27T00:00:00.000
Name: date_of_birth, dtype: object

<details>
    <summary>Answer</summary>
    <code>animals.groupby('animal_type')['date_of_birth'].max()</code>
    </details>

## Pivoting a DataFrame

### `.pivot_table()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

Grouping by two different columns can be very helpful.

In [27]:
animals.groupby(by=['outcome_type', 'sex_upon_outcome']).agg(len)

                                  animal_id  datetime  monthyear  \
outcome_type    sex_upon_outcome
Adoption        Intact Female             1         1          1
                Intact Male              11        11         11
                Neutered Male           202       202        202
                Spayed Female           203       203        203
                Unknown                   6         6          6
Died            Intact Female             1         1          1
                Intact Male               1         1          1
                Neutered Male             2         2          2
                Spayed Female             1         1          1
                Unknown                   2         2          2
Disposal        Intact Female             1         1          1
                Unknown                   5         5          5
Euthanasia      Intact Female             7         7          7
                Intact Male               6         6          6
                Neutered Male             6         6          6
                Spayed Female             4         4          4
                Unknown                  86        86         86
Return to Owner Intact Female            20        20         20
                Intact Male              39        39         39
                Neutered Male            42        42         42
                Spayed Female            25        25         25
                Unknown                   4         4          4
Rto-Adopt       Intact Female             1         1          1
                Neutered Male             4         4          4
                Spayed Female             8         8          8
Transfer        Intact Female            91        91         91
                Intact Male              98        98         98
                Neutered Male            64        64         64
                Spayed Female            43        43         43
                Unknown                  11        11         11

                                  date_of_birth  outcome_subtype  animal_type  \
outcome_type    sex_upon_outcome
Adoption        Intact Female                 1                1            1
                Intact Male                  11               11           11
                Neutered Male               202              202          202
                Spayed Female               203              203          203
                Unknown                       6                6            6
Died            Intact Female                 1                1            1
                Intact Male                   1                1            1
                Neutered Male                 2                2            2
                Spayed Female                 1                1            1
                Unknown                       2                2            2
Disposal        Intact Female                 1                1            1
                Unknown                       5                5            5
Euthanasia      Intact Female                 7                7            7
                Intact Male                   6                6            6
                Neutered Male                 6                6            6
                Spayed Female                 4                4            4
                Unknown                      86               86           86
Return to Owner Intact Female                20               20           20
                Intact Male                  39               39           39
                Neutered Male                42               42           42
                Spayed Female                25               25           25
                Unknown                       4                4            4
Rto-Adopt       Intact Female                 1                1            1
                Neutered Male                 4                4            4
                Spayed Female                 8                8            8
Transfer        Intact Female                91               91           91
                Intact Male                  98               98           98
                Neutered Male                64               64           64
                Spayed Female                43               43           43
                Unknown                      11               11           11

                                  age_upon_outcome  breed  color  name
outcome_type    sex_upon_outcome
Adoption        Intact Female                    1      1      1     1
                Intact Male                     11     11     11    11
                Neutered Male                  202    202    202   202
                Spayed Female                  203    203    203   203
                Unknown                          6      6      6     6
Died            Intact Female                    1      1      1     1
                Intact Male                      1      1      1     1
                Neutered Male                    2      2      2     2
                Spayed Female                    1      1      1     1
                Unknown                          2      2      2     2
Disposal        Intact Female                    1      1      1     1
                Unknown                          5      5      5     5
Euthanasia      Intact Female                    7      7      7     7
                Intact Male                      6      6      6     6
                Neutered Male                    6      6      6     6
                Spayed Female                    4      4      4     4
                Unknown                         86     86     86    86
Return to Owner Intact Female                   20     20     20    20
                Intact Male                     39     39     39    39
                Neutered Male                   42     42     42    42
                Spayed Female                   25     25     25    25
                Unknown                          4      4      4     4
Rto-Adopt       Intact Female                    1      1      1     1
                Neutered Male                    4      4      4     4
                Spayed Female                    8      8      8     8
Transfer        Intact Female                   91     91     91    91
                Intact Male                     98     98     98    98
                Neutered Male                   64     64     64    64
                Spayed Female                   43     43     43    43
                Unknown                         11     11     11    11

But it has the unsavory side effect of creating a two-level index. This can be a good time to use `.pivot_table()`.

(There is also a `.pivot()`. For the somewhat subtle differences, see [here](https://stackoverflow.com/questions/30960338/pandas-difference-between-pivot-and-pivot-table-why-is-only-pivot-table-workin).)

#### Example

In [28]:
df = pd.DataFrame({"sex": ["male", "male", "male", "male", "male",
                          "female", "female", "female", "female"],
                    "num_puppies": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "breed": ["terrier", "retriever", "retriever", "terrier",
                          "terrier", "retriever", "terrier", "terrier",
                          "retriever"],
                    "past_owners": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "family_members": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

      sex num_puppies      breed  past_owners  family_members
0    male         one    terrier            1               2
1    male         one  retriever            2               4
2    male         one  retriever            2               5
3    male         two    terrier            3               5
4    male         two    terrier            3               6
5  female         one  retriever            4               6
6  female         one    terrier            5               8
7  female         two    terrier            6               9
8  female         two  retriever            7               9

In [29]:
# This first example aggregates values by taking the sum.

table = pd.pivot_table(df, values='past_owners', index=['sex', 'num_puppies'],
                     columns=['breed'], aggfunc=np.sum)
table

breed               retriever  terrier
sex    num_puppies
female one                4.0      5.0
       two                7.0      6.0
male   one                4.0      1.0
       two                NaN      6.0

#### Back to Austin animals

In [30]:
animals.pivot_table(index='outcome_type', columns='sex_upon_outcome', aggfunc=len)

                 age_upon_outcome                                          \
sex_upon_outcome    Intact Female Intact Male Neutered Male Spayed Female
outcome_type
Adoption                      1.0        11.0         202.0         203.0
Died                          1.0         1.0           2.0           1.0
Disposal                      1.0         NaN           NaN           NaN
Euthanasia                    7.0         6.0           6.0           4.0
Return to Owner              20.0        39.0          42.0          25.0
Rto-Adopt                     1.0         NaN           4.0           8.0
Transfer                     91.0        98.0          64.0          43.0

                             animal_id                            \
sex_upon_outcome Unknown Intact Female Intact Male Neutered Male
outcome_type
Adoption             6.0           1.0        11.0         202.0
Died                 2.0           1.0         1.0           2.0
Disposal             5.0           1.0         NaN           NaN
Euthanasia          86.0           7.0         6.0           6.0
Return to Owner      4.0          20.0        39.0          42.0
Rto-Adopt            NaN           1.0         NaN           4.0
Transfer            11.0          91.0        98.0          64.0

                                        ...          name              \
sex_upon_outcome Spayed Female Unknown  ... Intact Female Intact Male
outcome_type                            ...
Adoption                 203.0     6.0  ...           1.0        11.0
Died                       1.0     2.0  ...           1.0         1.0
Disposal                   NaN     5.0  ...           1.0         NaN
Euthanasia                 4.0    86.0  ...           7.0         6.0
Return to Owner           25.0     4.0  ...          20.0        39.0
Rto-Adopt                  8.0     NaN  ...           1.0         NaN
Transfer                  43.0    11.0  ...          91.0        98.0

                                                     outcome_subtype  \
sex_upon_outcome Neutered Male Spayed Female Unknown   Intact Female
outcome_type
Adoption                 202.0         203.0     6.0             1.0
Died                       2.0           1.0     2.0             1.0
Disposal                   NaN           NaN     5.0             1.0
Euthanasia                 6.0           4.0    86.0             7.0
Return to Owner           42.0          25.0     4.0            20.0
Rto-Adopt                  4.0           8.0     NaN             1.0
Transfer                  64.0          43.0    11.0            91.0


sex_upon_outcome Intact Male Neutered Male Spayed Female Unknown
outcome_type
Adoption                11.0         202.0         203.0     6.0
Died                     1.0           2.0           1.0     2.0
Disposal                 NaN           NaN           NaN     5.0
Euthanasia               6.0           6.0           4.0    86.0
Return to Owner         39.0          42.0          25.0     4.0
Rto-Adopt                NaN           4.0           8.0     NaN
Transfer                98.0          64.0          43.0    11.0

[7 rows x 50 columns]

### Exercise

Use `.pivot_table()` to add up the number of my tasks by category. Hint: Use `sum()` as your aggregating function.

In [31]:
tasks = pd.DataFrame({'category': ['house', 'house', 'school', 'school'],
                      'descr': ['kitchen', 'laundry', 'git', 'Python'],
                      'priority': [2, 3, 4, 1], 'num_tasks': [2, 1, 2, 3]})

tasks

  category    descr  priority  num_tasks
0    house  kitchen         2          2
1    house  laundry         3          1
2   school      git         4          2
3   school   Python         1          3

In [39]:
table = tasks.pivot_table(values='num_tasks', index='category', aggfunc=sum)
table

          num_tasks
category
house             3
school            5

<details>
    <summary>Answer</summary>
    <code>tasks.pivot_table(values='num_tasks', index='category', aggfunc=sum)</code>
    </details>

## Methods for Combining DataFrames: `.join()`, `.merge()`, `pd.concat()`

### `.join()`

In [42]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns=['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns=['age', 'MP'])

toy1

   age   HP
0   63  142
1   33   47

In [43]:
toy2

   age   MP
0   63  100
1   33  200

In [44]:
# We can't just join these as they are, since we haven't specified our suffixes.

toy1.join(toy2)

ValueError: columns overlap but no suffix specified: Index(['age'], dtype='object')

In [45]:
toy1.join(toy2, lsuffix='1', rsuffix='2')

   age1   HP  age2   MP
0    63  142    63  100
1    33   47    33  200

If we don't want to keep both, we could set the overlapping column as the index in each DataFrame:

In [46]:
toy1.set_index('age').join(toy2.set_index('age'))

      HP   MP
age
63   142  100
33    47  200

For more on this method, check out the [doc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html)!

### `.merge()`

Or we could use `.merge()`:

In [47]:
toy1.merge(toy2)

   age   HP   MP
0   63  142  100
1   33   47  200

In [48]:
ds_chars = pd.read_csv('data/ds_chars.csv', index_col=0)
ds_chars

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [49]:
states = pd.read_csv('data/states.csv', index_col=0)
states

  state   nickname     capital
0    WA  evergreen     Olympia
1    TX      alamo      Austin
2    DC   district  Washington
3    OH    buckeye    Columbus
4    OR     beaver       Salem

### The `how` Parameter

This parameter in both `.join()` and `.merge()` tells the compiler what sort of join to effect. We'll cover this in detail when we discuss SQL.

In [50]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='inner')
#inner says look at column i'm merging and see what's common. Then give me those

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

In [51]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='outer')
#outer fills in differences with NaN

     name     HP home_state state   nickname     capital
0    greg  200.0         WA    WA  evergreen     Olympia
1   miles  200.0         WA    WA  evergreen     Olympia
2    alan  170.0         TX    TX      alamo      Austin
3  rachel  200.0         TX    TX      alamo      Austin
4  alison  300.0         DC    DC   district  Washington
5     NaN    NaN        NaN    OH    buckeye    Columbus
6     NaN    NaN        NaN    OR     beaver       Salem

### `pd.concat()`

This method takes a *list* of pandas objects as arguments.

In [52]:
ds_full = pd.concat([ds_chars, states])
ds_full

     name     HP home_state state   nickname     capital
0    greg  200.0         WA   NaN        NaN         NaN
1   miles  200.0         WA   NaN        NaN         NaN
2    alan  170.0         TX   NaN        NaN         NaN
3  alison  300.0         DC   NaN        NaN         NaN
4  rachel  200.0         TX   NaN        NaN         NaN
0     NaN    NaN        NaN    WA  evergreen     Olympia
1     NaN    NaN        NaN    TX      alamo      Austin
2     NaN    NaN        NaN    DC   district  Washington
3     NaN    NaN        NaN    OH    buckeye    Columbus
4     NaN    NaN        NaN    OR     beaver       Salem

`pd.concat()`–– and many other pandas operations –– make use of an `axis` parameter. For this particular method I need to specify whether I want to concatenate the DataFrames *row-wise* (`axis=0`) or *column-wise* (`axis=1`). The default is `axis=0`, so let's override that!

In [53]:
ds_full = pd.concat([ds_chars, states], axis=1)
ds_full

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    TX      alamo      Austin
2    alan  170         TX    DC   district  Washington
3  alison  300         DC    OH    buckeye    Columbus
4  rachel  200         TX    OR     beaver       Salem

## King County Assessments

As data scientists, we want to build a model to predict the sale price of a house in Seattle in 2019, based on its square footage. We know that the King County Department of Assessments has comprehensive data available on real property sales in the Seattle area. We need to prepare the data.

### First, get the data!

Go [here](https://info.kingcounty.gov/assessor/DataDownload/default.aspx) and download two files: "Real Property Sales" and "Residential Building". Then unzip them. (Or you can run the cells below if you prefer.)

In [ ]:
# %%bash
# cd data
# curl -o property_sales.zip https://aqua.kingcounty.gov/extranet/assessor/Real%20Property%20Sales.zip

In [ ]:
# %%bash
# cd data
# curl -o res_bldg.zip https://aqua.kingcounty.gov/extranet/assessor/Residential%20Building.zip

In [ ]:
# zf = ZipFile('data/property_sales.zip', 'r')
# zf.extractall('data')
# zf.close()

In [ ]:
# zf = ZipFile('data/res_bldg.zip', 'r')
# zf.extractall('data')
# zf.close()

In [ ]:
# You'll need to use a new encoding here. List of all encodings here:
# https://docs.python.org/3/library/codecs.html#standard-encodings

# Both of these csv files have many columns, so we'll just pre-select
# which ones we want to use.

sales_df = pd.read_csv('/Users/gdamico/Downloads/EXTR_RPSale.csv',
                       encoding='latin-1',
                       usecols=['Major', 'Minor', 'DocumentDate', 'SalePrice'])

In [ ]:
sales_df.info()

In [ ]:
bldg_df = pd.read_csv('~/Downloads/EXTR_ResBldg.csv',
                     usecols=['Major', 'Minor', 'SqFtTotLiving', 'ZipCode'])

In [ ]:
bldg_df.info()

In [ ]:
sales_data = pd.merge(sales_df, bldg_df, on=['Major', 'Minor'])

In [ ]:
sales_data.head()

In [ ]:
sales_data.info()

We can see right away that we're missing ZIP codes for many of the sales transactions.

In [ ]:
sales_data.loc[sales_data['ZipCode'].isna()].head()

### Exercise

What percentage of housing records are missing ZIP codes?

<details>
    <summary>Answer</summary>
    <code>sales_data['ZipCode'].isna().sum() / sales_data.shape[0]</code>
    </details>

Let's drop the rows with missing zip codes.

In [ ]:
sales_data = sales_data.loc[~sales_data['ZipCode'].isna(), :]

sales_data.head()

## Time Permitting: Data Cleaning with Pandas

### 1. Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.

<details>
    <summary>One possible answer here</summary>
    <code>sales_data = sales_data[sales_data['SalePrice'] > 10000]</code>
    </details>

### 2. Investigate and handle non-numeric ZipCode values

Can you find a way to shorten ZIP+4 codes to the first five digits?

In [ ]:
def is_integer(x):
    try:
        _ = int(x)
    except ValueError:
        return False
    return True

sales_data.loc[sales_data['ZipCode'].apply(is_integer) == False, 'ZipCode'].head()

<details>
    <summary>One possible answer here</summary>
    <code>def five_digit_ZIP(x):
    try:
        return int(str(x)[:5])
    except:
        return x
sales_data['ZipCode'] = sales_data['ZipCode'].map(five_digit_ZIP)
sales_data = sales_data.loc[sales_data['ZipCode'].apply(is_integer) == True, :]
sales_data['ZipCode'] = sales_data['ZipCode'].map(int)</code>
    </details>

### 3. Add a column for PricePerSqFt

<details>
    <summary>Answer here</summary>
    <code>sales_data['PricePerSqFt'] = sales_data['SalePrice'] / sales_data['SqFtTotLiving']</code>
    </details>

### 4. Subset the data to 2021 sales only.

We can assume that the DocumentDate is approximately the sale date.

<details>
    <summary>Answer here</summary>
    <code>sales_data['DocumentDate'] = pd.to_datetime(sales_data['DocumentDate'])
sales_data = sales_data.loc[sales_data['DocumentDate'] > '12/31/2020']</code>
    </details>

### 5. What is the mean price per square foot for a house sold in Seattle in 2021?

<details>
    <summary>Answer here</summary>
    <code>sales_data['PricePerSqFt'].mean()</code>
    </details>

## Level Up: `pandas.set_option()`

We can adjust how `pandas` works by setting options in advance.

### Block Scientific Notation

For example, suppose we want to prevent numbers from being displayed in scientific notation.

In [ ]:
df = pd.DataFrame([[1e9, 2e9], [3e9, 4e9]])
df

Then we can use:

In [ ]:
pd.set_option('display.float_format', '{:.2f}'.format)

df

### See More Rows

Or suppose we want `pandas` to show more rows.

In [ ]:
df2 = pd.DataFrame(np.array(range(100)))
df2

In that case we can use:

In [ ]:
pd.set_option('display.max_rows', 100)

df2

For complete documentation, see [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html).